Rhino.Inside.Revit API
GeometryEncoder.ToMesh Method
Overload List
Name | Description
ToMesh(Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(Mesh)
 Converts the specified Rhino.Geometry.Mesh to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(SubD)
 Converts the specified Rhino.Geometry.SubD to an equivalent of Autodesk.Revit.DB.Mesh.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace